# SQL query exercise from coursera "The SQL" Final Lab
## 1. Import SQL-python and bit.io packages

In [1]:
import os
import time
import pandas as pd

import psycopg2
from bitdotio import bitdotio

## 2. Setting up API connection with database at bit.io account 

### Descriptions about the database:
- Company database for Classic Models (cm) was downloaded into private account from the publicly shared database originally used in coursera SQL course [1]. The full content of the database can be accessed from this link: https://bit.io/alanparadise/cm.
- The cm database contains 8 tables: customers, employees, offices, orderdetails, orders, payments, productlines, products.

### Configuring Jupyter & python env to execute query-based SQL commands on bit.io private database:

- Create a service account API at bit.io account with writer/reader credential [2].
- Install ipython-sql [3] and python-bitdotio [4] extensions to work with bit.io PostgreSQL server from python/jupyter environment.

In [2]:
%load_ext sql

In [3]:
# Establish connection to bitio with service API (writer credential)

%sql postgresql://<BitioAPI>@db.bit.io:5432/nicklee/courserasqlcm

In [4]:
# Test making query against the database

%sql SELECT * FROM customers WHERE customernumber<120;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
4 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, 21000),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, 71800),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, 117300),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, 118200)]

In [5]:
%%sql result_set <<
SELECT *
FROM customers
WHERE customernumber < 120;   -- executing multi-line query with << syntax to store into variable in python env

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
4 rows affected.
Returning data to local variable result_set

In [6]:
result_set

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, 21000),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, 71800),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, 117300),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, 118200)]

In [7]:
result_set.DataFrame() # store query set into pandas df

,customernumber,customername,contactlastname,contactfirstname,phone,addressline1,addressline2,city,state,postalcode,country,salesrepemployeenumber,creditlimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370,21000
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166,71800
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",None,Nantes,None,44000,France,1370,118200

In [8]:
%%sql
SELECT *
FROM customers
WHERE customernumber < 120;  -- magic cell (%%) allow making multi-line query too, seems commenting has to be done with SQL syntax (-- not #)

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
4 rows affected.

[(103, 'Atelier graphique', 'Schmitt', 'Carine ', '40.32.2555', '54, rue Royale', None, 'Nantes', None, '44000', 'France', 1370, 21000),
 (112, 'Signal Gift Stores', 'King', 'Jean', '7025551838', '8489 Strong St.', None, 'Las Vegas', 'NV', '83030', 'USA', 1166, 71800),
 (114, 'Australian Collectors, Co.', 'Ferguson', 'Peter', '03 9520 4555', '636 St Kilda Road', 'Level 3', 'Melbourne', 'Victoria', '3004', 'Australia', 1611, 117300),
 (119, 'La Rochelle Gifts', 'Labrune', 'Janine ', '40.67.8555', '67, rue des Cinquante Otages', None, 'Nantes', None, '44000', 'France', 1370, 118200)]

# 3. SQL query exercise from the course's final lab
#### 3.1. List  the names of the cities in alphabetical order where Classic Models has offices.

In [9]:
%sql SELECT city FROM offices ORDER BY city ASC;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
7 rows affected.

[('Boston',),
 ('London',),
 ('NYC',),
 ('Paris',),
 ('San Francisco',),
 ('Sydney',),
 ('Tokyo',)]

#### 3.2. List the EmployeeNumber, LastName, FirstName, Extension for all employees working out of the Paris office.

In [10]:
%%sql
SELECT EmployeeNumber, LastName, FirstName, Extension
FROM employees
WHERE officecode in (SELECT officecode FROM offices WHERE city='Paris');

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
5 rows affected.

[(1102, 'Bondur', 'Gerard', 'x5408'),
 (1337, 'Bondur', 'Loui', 'x6493'),
 (1370, 'Hernandez', 'Gerard', 'x2028'),
 (1401, 'Castillo', 'Pamela', 'x2759'),
 (1702, 'Gerard', 'Martin', 'x2312')]

#### 3.3. List the ProductCode, ProductName, ProductVendor, QuantityInStock and ProductLine for all products with a QuantityInStock between 200 and 1200.

In [11]:
%%sql
SELECT ProductCode, ProductName, ProductVendor, QuantityInStock, ProductLine
FROM products
WHERE quantityinstock BETWEEN 200 AND 1200;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
11 rows affected.

[('S12_3891', '1969 Ford Falcon', 'Second Gear Diecast', 1049, 'Classic Cars'),
 ('S18_2248', '1911 Ford Town Car', 'Motor City Art Classics', 540, 'Vintage Cars'),
 ('S18_2581', 'P-51-D Mustang', 'Gearbox Collectibles', 992, 'Planes'),
 ('S18_2795', '1928 Mercedes-Benz SSK', 'Gearbox Collectibles', 548, 'Vintage Cars'),
 ('S24_1046', '1970 Chevy Chevelle SS 454', 'Unimax Art Galleries', 1005, 'Classic Cars'),
 ('S32_3522', '1996 Peterbilt 379 Stake Bed with Outrigger', 'Red Start Diecast', 814, 'Trucks and Buses'),
 ('S50_1392', 'Diamond T620 Semi-Skirted Tanker', 'Highway 66 Mini Classics', 1016, 'Trucks and Buses'),
 ('S50_4713', '2002 Yamaha YZR M1', 'Autoart Studio Design', 600, 'Motorcycles'),
 ('S700_1938', 'The Mayflower', 'Studio M Art Models', 737, 'Ships'),
 ('S700_3167', 'F/A 18 Hornet 1/72', 'Motor City Art Classics', 551, 'Planes'),
 ('S72_3212', 'Pont Yacht', 'Unimax Art Galleries', 414, 'Ships')]

#### 3.4. List the ProductCode, ProductName, ProductVendor, BuyPrice and MSRP for the least expensive (lowest MSRP) product sold by ClassicModels.  (“MSRP” is the Manufacturer’s Suggested Retail Price.)

In [12]:
%%sql
SELECT ProductCode, ProductName, ProductVendor, BuyPrice, MSRP
FROM products
WHERE MSRP=(SELECT MIN(MSRP) FROM products);

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
1 rows affected.

[('S24_1937', '1939 Chevrolet Deluxe Coupe', 'Motor City Art Classics', 22.57, 33.19)]

#### 3.5. What is the ProductName and Profit of the product that has the highest profit (profit = MSRP minus BuyPrice).

In [13]:
%%sql 
SELECT ProductName, (MSRP-BuyPrice) AS Profit
FROM products
ORDER BY Profit DESC LIMIT 1

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
1 rows affected.

[('1952 Alpine Renault 1300', 115.72000000000001)]

#### 3.6. List the country and the number of customers from that country for all countries having just two  customers.  List the countries sorted in ascending alphabetical order. Title the column heading for the count of customers as “Customers”.

In [14]:
%%sql
SELECT country, COUNT(DISTINCT customernumber) AS Customers
FROM customers
GROUP BY Country HAVING COUNT(DISTINCT customernumber)=2 ORDER BY Country ASC;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
8 rows affected.

[('Austria', 2),
 ('Belgium', 2),
 ('Denmark', 2),
 ('Ireland', 2),
 ('Japan', 2),
 ('Norway  ', 2),
 ('Portugal', 2),
 ('Sweden', 2)]

#### 3.7. List the ProductCode, ProductName, and number of orders for the products with exactly 25 orders.  Title the column heading for the count of orders as “OrderCount”.

In [15]:
%%sql
SELECT P.productcode, P.productname, count(O.quantityordered) AS "OrderCount" 
FROM products P JOIN orderdetails O ON P.productcode = O.productcode 
GROUP BY P.productcode, productname HAVING count(O.quantityordered) = 25;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
12 rows affected.

[('S24_1046', '1970 Chevy Chevelle SS 454', 25),
 ('S18_4409', '1932 Alfa Romeo 8C2300 Spider Sport', 25),
 ('S24_1628', '1966 Shelby Cobra 427 S/C', 25),
 ('S24_3969', '1936 Mercedes Benz 500k Roadster', 25),
 ('S18_1749', '1917 Grand Touring Sedan', 25),
 ('S24_3191', '1969 Chevrolet Camaro Z28', 25),
 ('S24_3432', '2002 Chevy Corvette', 25),
 ('S18_3685', '1948 Porsche Type 356 Roadster', 25),
 ('S18_1589', '1965 Aston Martin DB5', 25),
 ('S18_2870', '1999 Indy 500 Monte Carlo SS', 25),
 ('S24_2766', '1949 Jaguar XK 120', 25),
 ('S18_2248', '1911 Ford Town Car', 25)]

#### 3.8. List the EmployeeNumber, Firstname + Lastname  (concatenated into one column in the answer set, separated by a blank and referred to as ‘name’) for all the employees reporting to Diane Murphy or Gerard Bondur.

In [16]:
%%sql
SELECT EmployeeNumber, CONCAT(Firstname, ' ', Lastname) AS "Name"
FROM employees
WHERE reportsto in (SELECT employeenumber FROM employees WHERE ( ((lastname='Murphy') and (firstname='Diane')) or ((lastname='Bondur') and (firstname='Gerard')) ) )

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
8 rows affected.

[(1056, 'Mary Patterson'),
 (1076, 'Jeff Firrelli'),
 (1337, 'Loui Bondur'),
 (1370, 'Gerard Hernandez'),
 (1401, 'Pamela Castillo'),
 (1501, 'Larry Bott'),
 (1504, 'Barry Jones'),
 (1702, 'Martin Gerard')]

#### 3.9. List the EmployeeNumber, LastName, FirstName of the president of the company (the one employee with no boss.)

In [17]:
%%sql
SELECT EmployeeNumber, LastName, FirstName
FROM employees
WHERE Jobtitle='President'

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
1 rows affected.

[(1002, 'Murphy', 'Diane')]

#### 3.10. List the ProductName for all products in the “Classic Cars” product line from the 1950’s.

In [18]:
%%sql
SELECT ProductName
FROM products
WHERE productline='Classic Cars' AND productname BETWEEN '1950' AND '1960';

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
6 rows affected.

[('1952 Alpine Renault 1300',),
 ('1957 Corvette Convertible',),
 ('1957 Ford Thunderbird',),
 ('1958 Chevy Corvette Limited Edition',),
 ('1952 Citroen-15CV',),
 ('1956 Porsche 356A Coupe',)]

#### 3.11. List the month name and the total number of orders for the month in 2004 in which ClassicModels customers placed the most orders.

In [19]:
%%sql
SELECT EXTRACT(MONTH FROM orderdate) AS MONTH, COUNT (D.ordernumber), SUM(quantityordered) AS TotalQtyOrdered 
FROM orders O JOIN orderdetails D ON O.ordernumber=D.ordernumber 
WHERE EXTRACT(YEAR FROM orderdate) = '2004' 
GROUP BY orderdate ORDER BY 2 DESC LIMIT 1;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
1 rows affected.

[(Decimal('11'), 35, Decimal('1365'))]

#### 3.12. List the firstname, lastname of employees who are Sales Reps who have no assigned customers.

In [20]:
%%sql
SELECT DISTINCT firstname, lastname 
FROM employees E LEFT OUTER JOIN customers C ON E.employeenumber = C.salesrepemployeenumber 
WHERE jobtitle = 'Sales Rep' AND C.salesrepemployeenumber is NULL;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
2 rows affected.

[('Tom', 'King'), ('Yoshimi', 'Kato')]

#### 3.13. List the customername of customers from Switzerland with no orders.

In [21]:
%%sql
SELECT customername 
FROM customers C 
WHERE country='Switzerland' AND customernumber NOT IN (SELECT customernumber FROM orders);

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
2 rows affected.

[('BG&E Collectables',), ('Precious Collectables',)]

#### 3.14. List the customername and total quantity of products ordered for customers who have ordered more than 1650 products across all their orders.

In [22]:
%%sql
SELECT customername, SUM(D.quantityordered) AS "TotalOrders"
FROM customers C JOIN orders O ON C.customernumber=O.customernumber
                 JOIN orderdetails D ON D.ordernumber=O.ordernumber
GROUP BY customername HAVING SUM(D.quantityordered) >1650;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
8 rows affected.

[('Muscle Machine Inc', Decimal('1775')),
 ('Euro+ Shopping Channel', Decimal('9327')),
 ('Australian Collectors, Co.', Decimal('1926')),
 ('La Rochelle Gifts', Decimal('1832')),
 ('Down Under Souveniers, Inc', Decimal('1691')),
 ('Mini Gifts Distributors Ltd.', Decimal('6366')),
 ('The Sharp Gifts Warehouse', Decimal('1656')),
 ('AV Stores, Co.', Decimal('1778'))]

#### 3.15. Create a NEW table named “TopCustomers” with three columns: CustomerNumber (integer), ContactDate (DATE) and  OrderTotal (a real number.)  None of these columns can be NULL.

In [23]:
%%sql
CREATE TABLE "TopCustomers" ( CustomerNumber INT, ContactDate DATE NOT NULL, OrderTotal REAL NOT NULL DEFAULT 0 );

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
Done.

[]

#### 3.16. Populate the new table “TopCustomers” with the CustomerNumber, today’s date, and the total value of all their orders (PriceEach * quantityOrdered) for those customers whose order total value is greater than $140,000.

In [24]:
%%sql
INSERT INTO "TopCustomers" (SELECT C.customernumber, current_date, sum(priceeach*quantityordered) 
FROM customers C  
                JOIN orders O ON C.customernumber = O.customernumber 
                JOIN orderdetails D ON O.ordernumber = D.ordernumber 

Group by C.customernumber HAVING sum(priceeach*quantityordered) >= 140000);

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
10 rows affected.

[]

#### 3.17. List the contents of the TopCustomers table in descending OrderTotal sequence.

In [25]:
%%sql 
SELECT * FROM "TopCustomers" ORDER BY 3 DESC;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
10 rows affected.

[(141, datetime.date(2023, 2, 7), 820689.56),
 (124, datetime.date(2023, 2, 7), 591827.3),
 (114, datetime.date(2023, 2, 7), 180585.06),
 (151, datetime.date(2023, 2, 7), 177913.95),
 (119, datetime.date(2023, 2, 7), 158573.12),
 (148, datetime.date(2023, 2, 7), 156251.03),
 (323, datetime.date(2023, 2, 7), 154622.08),
 (131, datetime.date(2023, 2, 7), 149085.16),
 (187, datetime.date(2023, 2, 7), 148410.1),
 (450, datetime.date(2023, 2, 7), 143536.27)]

#### 3.18. Add a new column to the TopCustomers table called OrderCount (integer).

In [26]:
%%sql
ALTER TABLE "TopCustomers" 
ADD COLUMN OrderCount INT NOT NULL DEFAULT 0;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
Done.

[]

#### 3.19. Update the Top Customers table, setting the OrderCount to a random number between 1 and 10.  Hint:  use (RANDOM() *10)

In [27]:
%%sql 
UPDATE "TopCustomers" SET OrderCount = CEIL(RANDOM()*10);

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
10 rows affected.

[]

#### 3.20. List the contents of the TopCustomers table in descending OrderCount sequence. (10 rows)

In [28]:
%%sql
SELECT * FROM "TopCustomers" ORDER BY 4 DESC;

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
10 rows affected.

[(141, datetime.date(2023, 2, 7), 820689.56, 10),
 (187, datetime.date(2023, 2, 7), 148410.1, 10),
 (124, datetime.date(2023, 2, 7), 591827.3, 9),
 (148, datetime.date(2023, 2, 7), 156251.03, 8),
 (151, datetime.date(2023, 2, 7), 177913.95, 8),
 (450, datetime.date(2023, 2, 7), 143536.27, 6),
 (114, datetime.date(2023, 2, 7), 180585.06, 5),
 (323, datetime.date(2023, 2, 7), 154622.08, 4),
 (119, datetime.date(2023, 2, 7), 158573.12, 2),
 (131, datetime.date(2023, 2, 7), 149085.16, 1)]

#### 3.21. Drop the TopCustomers table. (no answer set)

In [29]:
%%sql
DROP TABLE "TopCustomers";

 * postgresql://BitioCMWriterAPI:***@db.bit.io:5432/nicklee/courserasqlcm
Done.

[]

#### References:
1. The Structured Query Language (Coursera course by CU Boulder). Link to the database: https://bit.io/alanparadise/cm
2. https://docs.bit.io/docs/your-connection-credentials
3. https://github.com/catherinedevlin/ipython-sql; https://pypi.org/project/ipython-sql/
4. https://github.com/bitdotioinc/python-bitdotio; https://pypi.org/project/bitdotio/
5. https://realpython.com/python-sql-libraries/
6. https://towardsdatascience.com/jupyter-magics-with-sql-921370099589
7. Publicly shared database on bit.io: https://github.com/bitdotioinc/public-data